transactions/app/controllers/api/v1/transactions_controller.rb

INSERT INTO `transactions` (`title`, `description`, `amount`, `bank_name`, `archived`, `created_at`, `updated_at`, `category_id`) VALUES ('xxx', ' xxxxxxxxxxxxxxxxxx', 150.0, 'xx', FALSE, '2023-12-12 13:39:07.729769', '2023-12-12 13:39:07.729769', 1)
---
      def create
        @transaction = Transaction.new(transaction_params)
        if @transaction.save

UPDATE `transactions` SET `transactions`.`title` = 'xx', `transactions`.`description` = ' xx', `transactions`.`bank_name` = 'xx', `transactions`.`updated_at` = '2023-12-12 13:31:20.404527' WHERE `transactions`.`id` = 22
---
      def update
        if @transaction.update(transaction_params)

UPDATE `transactions` SET `transactions`.`archived` = TRUE, `transactions`.`updated_at` = '2023-12-12 14:12:31.207380' WHERE `transactions`.`id` = 5
---
      def destroy
        @transaction.update(archived: true)

SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`archived` = TRUE
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`created_at` BETWEEN '2023-12-11 00:00:00' AND '2023-12-17 23:59:59.999999' AND `transactions`.`created_at` BETWEEN '2023-12-11 00:00:00' AND '2023-12-17 23:59:59.999999'
---
      def archive
        @transactions = Transaction.where(archived: true)
        render json: @transactions.map { |transaction| serialize_transaction(transaction) }

SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`created_at` BETWEEN '2023-12-12 00:00:00' AND '2023-12-12 23:59:59.999999' AND `transactions`.`created_at` BETWEEN '2023-12-12 00:00:00' AND '2023-12-12 23:59:59.999999'
SELECT `transactions`.* FROM `transactions` WHERE (title LIKE '%gro%')
---
      def filter
        @transactions = Transaction.all
        filter_transactions
        render json: @transactions.map { |transaction| serialize_transaction(transaction) }

SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`archived` IS NULL
---
      def serialized_transactions
        Transaction.where(archived: false).map { |transaction| serialize_transaction(transaction) }

SELECT `categories`.* FROM `categories`
---
      def serialized_categories
        Category.all.map { |category| { id: category.id, name: category.name } }

SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`id` = 1 LIMIT 1
---
      def set_transaction
        @transaction = Transaction.find(params[:id])